Autodesk.Revit.DB.BooleanOperationsUtils.ExecuteBooleanOperationModifyingOriginalSolidInternal(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.BooleanOperationsType)
Perform a boolean geometric operation between two solids, and modify the original solid to represent the result.
Remarks:
This operation modifies the original input Geometry object.
solid0:
The original solid object, can only be the GeometryCreationUtils geometry.
solid1:
The second solid object. A copy will be taken of the input object, so any solid whether obtained from a Revit element or not would be accepted.
booleanType:
boolean operation type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to perform the boolean operation for the two solids.
Since:
2012

Autodesk.Revit.DB.BooleanOperationsUtils.ExecuteBooleanOperation(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.BooleanOperationsType)
Perform a boolean geometric operation between two solids, and return a new solid to represent the result.
solid0:
The first solid object. A copy will be taken of the input object, so any solid whether obtained from a Revit element or not would be accepted.
solid1:
The second solid object. A copy will be taken of the input object, so any solid whether obtained from a Revit element or not would be accepted.
booleanType:
boolean operation type.
Returns:
The result geometry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to perform the boolean operation for the two solids.
Since:
2012

Autodesk.Revit.DB.BooleanOperationsUtils.ExecuteBooleanOperationModifyingOriginalSolid(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.BooleanOperationsType)
Perform a boolean geometric operation between two solids, and modify the original solid to represent the result.
Remarks:
This operation modifies the original input Geometry objects.
solid0:
The original solid object. This object cannot be obtained directly from a Revit element.
This means that Autodesk.Revit.DB.GeometryObject.IsElementGeometry cannot be true.
solid1:
The second solid object. A copy will be taken of the input object, so any solid whether obtained from a Revit element or not would be accepted.
booleanType:
boolean operation type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the original solid object is the geometry of Revit model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to perform the boolean operation for the two solids.
Since:
2012